IDEA StatiCa Open Model
BeamData.OriginalModelId Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Get or set the identification in the original model In the case of the imported connection from another application
 Namespace: IdeaRS.OpenModel.Connection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public string OriginalModelId { get; set; }
Public Property OriginalModelId As String
	Get
	Set
public:
property String^ OriginalModelId {
	String^ get ();
	void set (String^ value);
}
Property Value
Type: String
See Also
Reference
BeamData Class
IdeaRS.OpenModel.Connection Namespace